Subscribers

<?xml version="1.0" encoding="UTF-8"?>
    <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
            <soapenv:Header>
    <fueloauth>{{accessToken}}</fueloauth>
  </soapenv:Header>
   <soapenv:Body>
    <CreateRequest xmlns="http://exacttarget.com/wsdl/partnerAPI">
        <Options/>
        <Objects xsi:type="ns2:DataExtension" xmlns:ns2="http://exacttarget.com/wsdl/partnerAPI">
            <CustomerKey>Subscribers Data View</CustomerKey>
            <Name>Subscribers Data View</Name>
            <Description>Mimics the Subscribers Data View</Description>
            <IsSendable>false</IsSendable>
            <IsTestable>false</IsTestable>
            <Fields>
                <Field xsi:type="ns2:DataExtensionField">
                    <CustomerKey>SubscriberID</CustomerKey>
                    <Name>SubscriberID</Name>
                    <Label>SubscriberID</Label>
                    <IsRequired>true</IsRequired>
                    <IsPrimaryKey>false</IsPrimaryKey>
                    <FieldType>Number</FieldType>
                </Field>
                <Field xsi:type="ns2:DataExtensionField">
                    <CustomerKey>DateUndeliverable</CustomerKey>
                    <Name>DateUndeliverable</Name>
                    <Label>DateUndeliverable</Label>
                    <IsRequired>false</IsRequired>
                    <IsPrimaryKey>false</IsPrimaryKey>
                    <FieldType>Date</FieldType>
                </Field>
                <Field xsi:type="ns2:DataExtensionField">
                    <CustomerKey>DateJoined</CustomerKey>
                    <Name>DateJoined</Name>
                    <Label>DateJoined</Label>
                    <IsRequired>false</IsRequired>
                    <IsPrimaryKey>false</IsPrimaryKey>
                    <FieldType>Date</FieldType>
                </Field>
                <Field xsi:type="ns2:DataExtensionField">
                    <CustomerKey>DateUnsubscribed</CustomerKey>
                    <Name>DateUnsubscribed</Name>
                    <Label>DateUnsubscribed</Label>
                    <IsRequired>false</IsRequired>
                    <IsPrimaryKey>false</IsPrimaryKey>
                    <FieldType>Date</FieldType>
                </Field>
                <Field xsi:type="ns2:DataExtensionField">
                    <CustomerKey>Domain</CustomerKey>
                    <Name>Domain</Name>
                    <Label>Domain</Label>
                    <IsRequired>false</IsRequired>
                    <IsPrimaryKey>false</IsPrimaryKey>
                    <FieldType>Text</FieldType>
                    <MaxLength>254</MaxLength>
                </Field>
                <Field xsi:type="ns2:DataExtensionField">
                    <CustomerKey>EmailAddress</CustomerKey>
                    <Name>EmailAddress</Name>
                    <Label>EmailAddress</Label>
                    <IsRequired>true</IsRequired>
                    <IsPrimaryKey>false</IsPrimaryKey>
                    <FieldType>EmailAddress</FieldType>
                </Field>
                <Field xsi:type="ns2:DataExtensionField">
                    <CustomerKey>BounceCount</CustomerKey>
                    <Name>BounceCount</Name>
                    <Label>BounceCount</Label>
                    <IsRequired>true</IsRequired>
                    <IsPrimaryKey>false</IsPrimaryKey>
                    <FieldType>Number</FieldType>
                </Field>
                <Field xsi:type="ns2:DataExtensionField">
                    <CustomerKey>SubscriberKey</CustomerKey>
                    <Name>SubscriberKey</Name>
                    <Label>SubscriberKey</Label>
                    <IsRequired>true</IsRequired>
                    <IsPrimaryKey>false</IsPrimaryKey>
                    <FieldType>Text</FieldType>
                    <MaxLength>254</MaxLength>
                </Field>
                <Field xsi:type="ns2:DataExtensionField">
                    <CustomerKey>SubscriberType</CustomerKey>
                    <Name>SubscriberType</Name>
                    <Label>SubscriberType</Label>
                    <IsRequired>true</IsRequired>
                    <IsPrimaryKey>false</IsPrimaryKey>
                    <FieldType>Text</FieldType>
                    <MaxLength>100</MaxLength>
                </Field>
                <Field xsi:type="ns2:DataExtensionField">
                    <CustomerKey>Status</CustomerKey>
                    <Name>Status</Name>
                    <Label>Status</Label>
                    <IsRequired>false</IsRequired>
                    <IsPrimaryKey>false</IsPrimaryKey>
                    <FieldType>Text</FieldType>
                    <MaxLength>12</MaxLength>
                </Field>
                <Field xsi:type="ns2:DataExtensionField">
                    <CustomerKey>Locale</CustomerKey>
                    <Name>Locale</Name>
                    <Label>Locale</Label>
                    <IsRequired>false</IsRequired>
                    <IsPrimaryKey>false</IsPrimaryKey>
                    <FieldType>Locale</FieldType>
                </Field>
            </Fields>
        </Objects>
    </CreateRequest>
</soapenv:Body>
</soapenv:Envelope>
